tutorials/compressible/realGasPISOSolver/ras/IAPWS97_Pipe/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPisoFoam;

startFrom       latestTime;

//startTime       0;

stopAt          endTime;

endTime         2.5;

deltaT          1e-5;

writeControl    runTime;

writeInterval  1e-2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

adjustTimeStep  yes;

maxCo          0.5;

maxDeltaT       1e-3;

runTimeModifiable yes;

libs
(
    "libIAPWSThermo.so"
    "libfreesteam.so"
);


// ************************************************************************* //
